<!--여기는 치매백과사전 컴포넌트야-->
<template>
    <div>
        <router-view>
        </router-view>
        <div class="dementia">
            <div class="part1">
                <h1>1. 건망증과 치매의 차이점</h1>
                <p>나이가 들면 기억력이 떨어져 건망증이 잘 생깁니다. 건망증은 어떤 사실을 기억을 하지만 저장된 기억을 불러들이는 과정에 장애가 있어서 주로 발생합니다.
                     건망증인 경우 차근차근 생각을 더듬어 보면 잊었던 사실을 기억을 해내는 수가 많습니다.
                </p>
                <p>그러나 치매에서 보이는 기억장에는 그런 사실 자체를 잊어버리게 됩니다. "중요한 약속이 있었는데 어디서 몇 시에 모이기로 했더라?"
                    <br>이렇게 되면 건망증이고 "뭐? 나는 그런 약속을 한 적이 없다고 하면 치매에 의한 기억장애일 가능성이 있습니다.
                </p>
                <p>
                    치매는 단순한 기억장애가 아니라 다른 여러 인지기능의 장애가 동반되어 사회생활이나 일상생활에 지장을 주는 경우를 말합니다.<br> 기억장애만 있고 다른 장애는 없는 경우를
                     경한 인지기능장애라고 하는데 이런 사람들 중 20% 정도는 치매로 발전하기 때문에 계속적인 관찰이 필요합니다.
                </p>
            </div>
            <div class="part2">
                <h1>2. 치매의 증상</h1>
                <p>치매의 증후는 다음과 같은 것들이 있습니다.</p>
                <ul>
                    <li><p>건망증이 심해진다.</p></li>
                    <li><p>새로운 정보를 배우거나 지시사항을 따르지 못한다.</p></li>
                    <li><p>같은 이야기를 계속해서 반복하거나 같은 질문을 여러번 되풀이한다.</p></li>
                    <li><p>적절한 단어를 찾지 못하고 말이나 글을 끝내지 못한다.</p></li>
                    <li><p>이치에 맞지 않는 말을 한다(횡설수설한다).</p></li>
                    <li><p>물건을 잃어버리거나 감추고 또는 다른 사람이 물건을 훔쳤다고 비난한다.</p></li>
                    <li><p>시간개념이 흐려진다.</p></li>
                    <li><p>다른 사람을 알아보지 못한다.</p></li>
                    <li><p>공포, 초조, 슬픔, 분노 그리고 불안을 보인다(감정의 변화가 심하다).</p></li>
                    <li><p>음식 만들기, 식사하기, 운전 또는 목욕하기 등 일상적인 일들을 하지 못한다.</p></li>
                </ul>
            </div>
            <div class="part3">
                <h1>3. 치매 환자의 구강문제</h1>
                <p>치매가 진행되면서 환자는 스스로 아래와 같은 행동을 할 수없게 됩니다.</p>
                <ul>
                    <li><p>치아를 효과적으로 닦는것</p></li>
                    <li><p>치아의 청결 유지에 대한 이해</p></li>
                    <li><p>치과치료에 대한 필요(요구)를 표현하는 것</p></li>
                    <li><p>통증을 포함한 치과 증상을 설명하는것</p></li>
                    <li><p>치료에 대한 결정과정에 참여하는것</p></li>
                </ul>
                <p>치매환자는 통증이나 불편감이 있다는 것을 말할 수 없을 때가 올 수 있습니다. 치매환자들은 치과문제의 표시일 수 있는 여러 가지 행동적 변화가 나타나게 되는데,
                     다음과 같은 행동이 반복적으로 나타난다면 보호자가 환자의 행동을 알아차리고 치과진료를 받을 수 있도록 하는 것이 중요합니다.
                </p>
                <ul>
                    <li><p>음식, 특히 딱딱하거나 차가운 음식 거부</p></li>
                    <li><p>종종 얼굴이나 입을 잡아당김</p></li>
                    <li><p>전에 하던 의치를 끼지 않음</p></li>
                    <li><p>초조 혹은 신음, 소리지름의 증가</p></li>
                    <li><p>수면방해</p></li>
                    <li><p>일상생활에 대한 참여 거부</p></li>
                    <li><p>공격적인 행동</p></li>
                </ul>
            </div>
            <div class="part4">
                <h1>4. 치매환자의 구강 위생방법</h1>
                <div>
                    <p>5~14점용 : 기억상실성 경도인지장애</p>
                    <p>치매환자는 기억력 및 운동기능이 감소함에 따라 구강관리에 소홀해지기 쉬워 구강질환이 늘어나게 됩니다. 따라서 가족들은 매 식후에, 그리고 취점 전에 이닦기를 하도록 격려하고 관찰합니다.</p>
                    <p>칫솔은 부드러운 것을 사용하여 잇몸과 치아의 출혈을 방지합니다.</p>
                    <p>의치는 자기전에는 빼서 보관하여 잇몸에 무리가 가지 않도록 합니다.</p>
                    <p>치매환자의 칫솔과 치약을 나란히 세면대 위에 올려두거나, 대상자의 칫솔에 치약을 묻혀서 세면대에 올려두고 대상자 스스로 이를 닦도록 유도합니다.</p>
                </div>
                <div>
                    <p>15점 이상용 : 알츠하이머 치매</p>
                    <p>치매가 진행되면 스스로 이닦기를 할 수없게 되는데 그대로 내버려두면 입냄새가 많이 날뿐만 아니라 세균이 자라게 되어 페렴이 생기기도 합니다. 그러므로 식사 후에 세번은 이를 닦거나 입안을 헹구어 낼 수 있도록 도와줍니다.</p>
                    <p>구강위생을 시행할 때는 젓가락에 거즈나 작은 수건을 감고 구강청결제 액에 젹서서 짜낸 다음 치매환자의 입을 벌리고 구강 청결제를 적신 거즈를 사용하여 치아, 잇몸, 혀, 점막을 닦습니다.</p>
                    <p>구강위생을 시행 할 때 흡인을 방지하기 위해 앉은 자세나 반쯤 앉은 자세가 바람직하나 불가능한 경우 옆으로 눕히고 머리를 들어 올린 후 시행합니다.</p>
                    <p>비위관으로 영양을 공급하는 치매환자의 경우 음식물을 씹지 않아 침의 분비량이 줄어 입안이 쉽게 건조해지고 입 냄새가 심해지므로 밥을 먹지 않더라도 구강위생을 규칙적으로 실시합니다.</p>
                </div>
            </div>
            <div class="part5">
                <h1>5. 정상적인 노화과정에서의 뇌의 인지기능은 어떤가요?</h1>
                <p>
                    나이가 들면 뇌 세포의 숫자가 줄어들고 이에 따라 인지 기능이 떨어지는 것은 필연적이라고 할 수 있습니다. 그러나 나이가 들수록 생각의 속도는 느려지지만 그 정확도는 떨어지지 않습니다.
                     그리고 판단력은 나이가 들어도 대개는 잘 유지됩니다.
                </p>
                <p>
                    예로부터 중요한 결정을 내려야 할 경우에 나이든 원로들의 말을 존중했던 것도 이 때문일 것입니다. 말을 하러나 이해하는 능력은 20대에 최고로 발달하다 그 이후 서서히
                     떨어지는데 80대가 되어도 이 기능은 비교적 잘 유지됩니다.
                </p>
                <p>
                    기억력은 나이가 들면서 감소하는데 주로 새로운것을 기억하는 능력이 떨어집니다. 어릴때 살던 고향에 관한 기억들은 잘 잊혀지지 않아 추억으로 남아있지만 최근에 있었던
                     사실들을 기억하지 못하는 경우가 있습니다. 노인들도 반복해서 배우면 얼마든지 새로운 사실들을 배울 수는 있으나 한번 배운 것을 기억해내는 능력은 떨어지게 됩니다.
                </p>
            </div>
            <div class="part6">
                <h1>6. 알츠하이머병은 어떻게 진행되나요?</h1>
                <p>
                    알츠하이머 환자는 최근에 일어난 일을 기억하는 단기기억중추가 먼저 침범되고 병이 진행하면서 언어, 계산, 방향감각 등을 담당하는 부위의 신경세포가 영향을 받게됩니다.
                     따라서 치매 환자들 대부분 초기 단계에서는 옛날 일은 비교적 상세히 기억하는 반면 최근의 일을 잘 기억하지 못하여 같은 질문을 반복하는 경향을 나타나게 됩니다.
                </p>
                <p>
                    알츠하이머병은 증상 발생 후 짧게는 2년 길게는 20년 이상 생존하기도 합니다. 평균 생존 기간은 8년 정도 입니다. 알츠하이명 병을 초기, 중기, 말기로 구분하기도 합니다만
                     사람에 따라 어느 단계에서 어느정도 지속될지 일률적으로 진행단계를 예측하기는 어렵습니다.
                </p>
                <p>진행단계는 다음과 같습니다.</p>
                <p>
                    1단계 : 초기증상은 경미한 기억장애로서 매우 서서히 나타납니다. 기억장애는 주로 최근의 사건에 관한 것이며 대화도중 적절한 단어를 찾지 못하며 일의 능률이 떨어지고 성격의
                     변화가 나타나기도합니다. 이 기간은 약 5년 정도 지속됩니다.
                </p>
                <p>
                    2단계 : 1단계에 나타났던 증상들이 더욱 심해지고 언어장애가 가장 심하게 나타나는 시기입니다. 환자는 물건 이름을 대지 못하고 논리적인 대화가 불가능하게 됩니다. 시간 관념이
                     없어지며 방향감각이 없어지고 사람을 잘 알아보지 못합니다. 성격장애가 심해져서 남을 의심하거나 과격한 행동을 보이기도하고 대소변을 잘 가리지 못하는 증상이 나타나기 시작합니다.
                      이러한 변화는 길게는 약 12년까지 지속됩니다.
                </p>
                <p>
                    3단계 : 이 단계에 이르면 모든 기능에 많은 제약이 생겨 먹고 마시는 방법조차 잊어버려 몸무게가 20%~30% 감소하기도 합니다. 더 이상 혼자 걷기가 불가능해지고 모든 기억이 없어져 24시간
                     전적으로 남에게 의존해 생명을 유지해야 합니다. 거의 누워서 지내야 하기 때문에 각종 감염 특히 폐렴이나 요로 감염 때문에 사망하게 됩니다. 대략 이 시기는 3~4년 지속됩니다.
                </p>
            </div>
        </div>
    </div>
</template>
<script>
export default {
}
</script>
<style scoped>
router-view {
    width: fit-content;
    height: fit-content;
}
.dementia {
    display: inline-block;
    width: 75%;
    float: right;
    text-align: left;
}
.dementia h1{
    font-size: 23px;
    font-weight: 600;
}
.dementia div p{
    padding: 0 35px;
    font-size: 14px;
}
</style>
